app/controllers/parking_spaces_controller.rb

SELECT * FROM "parking_spaces" WHERE ("parking_spaces"."id" = 1)
---
  def show
    @parking_space = ParkingSpace.find(params[:id])

SELECT * FROM "parking_spaces" WHERE ("parking_spaces"."id" = 2)
---
  def edit
    @parking_space = ParkingSpace.find(params[:id])

INSERT INTO "parking_spaces" ("created_at", "updated_at", "amount", "vehicle_type_id", "user_id", "park_id", "amount_free") VALUES('2010-05-16 08:04:30', '2010-05-16 08:04:30', NULL, NULL, NULL, NULL, NULL)
---
  def create
    @parking_space = ParkingSpace.new(params[:parking_space])

    respond_to do |format|
      if @parking_space.save

SELECT * FROM "parking_spaces" WHERE ("parking_spaces"."id" = 2)
UPDATE "parking_spaces" SET "updated_at" = '2010-05-16 08:30:43', "vehicle_type_id" = 2 WHERE "id" = 2
---
  def update
    @parking_space = ParkingSpace.find(params[:id])

    respond_to do |format|
      if @parking_space.update_attributes(params[:parking_space])

SELECT * FROM "parking_spaces" WHERE ("parking_spaces"."id" = 1)
DELETE FROM "parking_spaces" WHERE "id" = 1
---
  def destroy
    @parking_space = ParkingSpace.find(params[:id])
    @parking_space.destroy