app/controllers/parks_controller.rb

  def show
    @park = Park.find(params[:id])
    @parking_space = ParkingSpace.new
    @vehicles = {"Selecione" => ""}
    VehicleType.all.each do |vehicle|
      @vehicles.merge!({vehicle.name => vehicle.id}) unless ParkingSpace.find(:all, :conditions => {:vehicle_type_id => vehicle.id}).count > 0
---
SELECT * FROM "parks" WHERE ("parks"."id" = 1)
SELECT name, id FROM "vehicle_types" LIMIT 1
SELECT * FROM "parking_spaces" WHERE ("parking_spaces"."vehicle_type_id" = 1)

  def edit
    @park = Park.find(params[:id])
---
SELECT * FROM "parks" WHERE ("parks"."id" = 1)

  def create
    @park = Park.new(params[:park])

    respond_to do |format|
      if @park.save
---
INSERT INTO "parks" ("name", "address", "created_at", "updated_at") VALUES('Stapar Estacionamentos', 'Joinville, Bairro Bom Retiro, CEP 89219-905; ', '2010-05-14 04:47:50', '2010-05-14 04:47:50')