app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at", "login", "password") VALUES('Pitágoras Gervasi Galiotto', '2010-05-14 04:04:14', '2010-05-14 04:04:14', 'pitagg@gmail.com', '123456')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save