app/controllers/vehicle_types_controller.rb

  def show
    @vehicle_type = VehicleType.find(params[:id])
---
SELECT * FROM "vehicle_types" WHERE ("vehicle_types"."id" = 1)

  def edit
    @vehicle_type = VehicleType.find(params[:id])
---
SELECT * FROM "vehicle_types" WHERE ("vehicle_types"."id" = 1)

  def create
    @vehicle_type = VehicleType.new(params[:vehicle_type])

    respond_to do |format|
      if @vehicle_type.save
---
INSERT INTO "vehicle_types" ("name", "created_at", "updated_at", "description") VALUES('Carro ', '2010-05-14 05:13:40', '2010-05-14 05:13:40', 'Veículo convencional com ou sem carroceria')